// 1. Используя метод map() напишите код, который получает из массива строк новый массив, содержащий их длины.

// var vegetables = ['Капуста', 'Репа', 'Редиска', 'Морковка'];

// let vegetableLength = vegetables.map((el) => el.length);

// console.log( vegetableLength );

// 2. Имеется массив простых чисел: numbers = [2, 3, 5, 7, 11, 13, 17, 19]. Использую метод reduce() напишите функцию currentSums(numbers),
//    которая возвращает новый массив из такого же числа элементов, в котором на каждой позиции будет находиться сумма элементов массива numbers
//    до этой позиции включительно.

// let numbers = [2, 3, 5, 7, 11, 13, 17];

//  function currentSums(numbers) {
//      let result = [];

//      numbers.reduce((a, b, i) => result[i] = a + b, 0);
// console.log(result);
//  }
// currentSums(numbers); // [2, 2+3, 2+3+5, 2+3+5+7, 2+3+5+7+11, 2+3+5+7+11+13, 2+3+5+7+11+13+17] = [ 2,5,10,17,28,41,58]

// 3. Напишите код, который получает из массива чисел новый массив, содержащий пары чисел,
//    которые в сумме должны быть равны семи: (0:7), (1:6) и т.д.

var arr = [0, 1, 2, 3, 4, 5, 6, 7];
function sumSeven(numbers) {

 
    
}


